app/Http/Controllers/AuthorController.php

insert into `authors` (`username`, `password`, `updated_at`, `created_at`) values ('sunjida', 'sunjida', '2022-08-27 10:55:32', '2022-08-27 10:55:32')
---
    public function add_author(){
        $author= new Author();
        $author->username ='mim';
        $author->password ='mim123';
        $author->save();