app/Http/Controllers/AuthorpostController.php

select * from `authors` where `authors`.`id` = '1' limit 1
insert into `authorposts` (`title`, `cat`, `author_id`, `updated_at`, `created_at`) values ('Title 1', 'Cat 2', 1, '2022-08-27 16:02:19', '2022-08-27 16:02:19')
---
    public function add_post($id){
        $author= Author::find($id);
        $post= new Authorpost();
        $post->title ='Title 1';
        $post->cat ='Cat 2';
        $author->post()->save($post);

select * from `authors` where `authors`.`id` = '1' limit 1
---
    function show_post($id){
        $post = Author::find($id)->post;