app/Http/Controllers/CarController.php

    function add_car($id){
        $mechanic = Machanic::find($id);
        $car= new Car();
        $car->carModel="farari";
        $mechanic->car()->save($car);
---
select * from `machanics` where `machanics`.`id` = '2' limit 1
insert into `cars` (`carModel`, `machanic_id`, `updated_at`, `created_at`) values ('toyta', 2, '2022-08-28 15:50:25', '2022-08-28 15:50:25')