app/Http/Controllers/CustomerController.php

insert into `customers` (`name`, `email`, `updated_at`, `created_at`) values ('kabir', 'kabir@gmailc.com', '2022-08-25 20:00:18', '2022-08-25 20:00:18')
---
    function add_customer(){
        $mobile= new Mobile();
        $mobile->model= "samsung";

        $customer = new Customer();
        $customer->name="sunjid";
        $customer->email="sunjid@gmailc.com";
        $customer->save();

select * from `customers` where `customers`.`id` = '6' limit 1
select * from `mobiles` where `mobiles`.`customer_id` = 6 and `mobiles`.`customer_id` is not null limit 1
---
    function show_mobile($id){
        $mobile= Customer::find($id)->mobile;