app/Http/Controllers/EloquentormController.php

select * from `eloquentorms`
---
    function index(){
        $customer=cache()->rememberForever('customer',
        function () {
            return DB::table('eloquentorms')->get();
        });

select * from `eloquentorms`
---
    function sendNotificationController(){
        $customer = Eloquentorm::all();