app/Http/Controllers/IndexController.php

    function index($id){
        $author = Author::find($id);
---
select * from `authors` where `authors`.`id` = '1' limit 1