app/Http/Controllers/MachanicController.php

insert into `machanics` (`name`, `updated_at`, `created_at`) values ('toothless', '2022-08-28 07:19:56', '2022-08-28 07:19:56')
---
    function add_machanic(){
        $mechanic = new Machanic();
        $mechanic ->name ='toothless';
        $mechanic ->save();