app/Http/Controllers/MobileController.php

select * from `customers` where `customers`.`id` = 2 limit 1
select * from `mobiles` where `mobiles`.`id` = '1' limit 1
---
    function show_customer($id){
        $customer= Mobile::find($id)->customer;