app/Http/Controllers/OwnerController.php

    public function add_owner($id){
        $car=Car::find($id);
        $owner= new Owner();
        $owner->name= 'salman';
        $owner->email= 'salman@gmail.com';
        $car->owner()->save($owner);
---
select * from `cars` where `cars`.`id` = '1' limit 1
insert into `owners` (`name`, `email`, `car_id`, `updated_at`, `created_at`) values ('imran khan', 'imran@gmail.com', 1, '2022-08-28 15:26:13', '2022-08-28 15:26:13')

    public function show_owner($id){
        // $owner= Machanic::find($id)->car->owner;
        $owner= Machanic::find($id)->owner; //hasOneThrough
---
select * from `machanics` where `machanics`.`id` = '2' limit 1
select `owners`.*, `cars`.`machanic_id` as `laravel_through_key` from `owners` inner join `cars` on `cars`.`id` = `owners`.`car_id` where `cars`.`machanic_id` = 2 limit 1