app/Http/Controllers/UserController.php

    function index(){
        return User::all();
---
select * from `users`